# **Data Science Learners Hub**

**Module : SQL**

**Topic :** <span style="color: var(--vscode-foreground); font-family: -apple-system, BlinkMacSystemFont, sans-serif; font-weight: 600;">SET Operators in SQL</span>

**email** : [luckyrathod.forum@gmail.com](mailto:luckyrathod.forum@gmail.com)

In [1]:
USE DataScienceLearnersHub

**Create a Simple Table:**

In [2]:
-- Creating a simple table for SET operator examples
CREATE TABLE StudentScores (
    StudentID INT PRIMARY KEY,
    Subject VARCHAR(50),
    Score INT
);

**Insert Queries:**

In [3]:
-- Inserting values into the StudentScores table
INSERT INTO StudentScores (StudentID, Subject, Score)
VALUES
    (1, 'Math', 85),
    (2, 'English', 92),
    (3, 'Science', 78),
    (4, 'History', 88),
    (5, 'Math', 90),
    (6, 'English', 85),
    (7, 'Science', 95),
    (8, 'History', 75);

In [4]:
SELECT * FROM StudentScores

StudentID,Subject,Score
1,Math,85
2,English,92
3,Science,78
4,History,88
5,Math,90
6,English,85
7,Science,95
8,History,75

### **SET Operators in MS SQL Server:**

**\`UNION\`:**

- Combines the result sets of two or more SELECT statements into a single result set, **removing duplicate rows.**

**Syntax :**

SELECT column1, column2, ... FROM table1

**UNION**

SELECT column1, column2, ... FROM table2;

In [5]:
SELECT StudentID, Subject, Score FROM StudentScores WHERE Subject = 'Math'
UNION
SELECT StudentID, Subject, Score FROM StudentScores WHERE Subject = 'English';

StudentID,Subject,Score
1,Math,85
5,Math,90
2,English,92
6,English,85

**\`INTERSECT\`:**

- Returns the common rows between the result sets of two SELECT statements.

**Syntax :**

SELECT column1, column2, ... FROM table1

**INTERSECT**

SELECT column1, column2, ... FROM table2;

In [6]:
SELECT StudentID, Subject, Score FROM StudentScores WHERE Subject = 'Math'
INTERSECT
SELECT StudentID, Subject, Score FROM StudentScores WHERE Score > 85;

StudentID,Subject,Score
5,Math,90

 **\`EXCEPT\`:**

- Returns the distinct rows from the result set of the first SELECT statement but not present in the result set of the second SELECT statement.

**Syntax :**

  

SELECT column1, column2, ... FROM table1

**EXCEPT**

SELECT column1, column2, ... FROM table2;

In [7]:
SELECT StudentID, Subject, Score FROM StudentScores WHERE Subject = 'Math'
EXCEPT
SELECT StudentID, Subject, Score FROM StudentScores WHERE Score > 85;

StudentID,Subject,Score
1,Math,85

###  **Peculiarities and Considerations for SET Operators:**

  

- **Data Types and Ordering:** The columns in the SELECT statements must have the same data types and appear in the same order.
- **Column Aliases:** If using column aliases, the aliases in the first SELECT statement determine the column names in the result set.

### **Most Common Mistakes:**

- **Mismatched Columns:** Forgetting to match the number and order of columns in the SELECT statements when using SET operators.
- **UNION vs UNION ALL:** Not understanding the difference between \`UNION\` (which removes duplicates) and \`UNION ALL\` (which includes all rows, including duplicates).
- **Data Type Compatibility:** Ensuring that data types are compatible between corresponding columns in different SELECT statements.